zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/MKE16Z64VLF4-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKE16Z64VLF4/signal_configuration.xml
 *
 * Copyright 2025, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MKE16Z64VLF4_
#define _ZEPHYR_DTS_BINDING_MKE16Z64VLF4_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0x7) << 8))

#define TSI0_CH17_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define ADC0_SE0_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define ACMP0_IN0_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define PTA0 KINETIS_MUX('A',0,1) /* PTA_0 */
#define LPI2C0_SCLS_PTA0 KINETIS_MUX('A',0,3) /* PTA_0 */
#define LPUART0_CTS_PTA0 KINETIS_MUX('A',0,6) /* PTA_0 */
#define TRGMUX_OUT3_PTA0 KINETIS_MUX('A',0,7) /* PTA_0 */
#define TRGMUX_OUT3_PTA0_PTA0_PTA0_PTA0 KINETIS_MUX('A',0,7) /* PTA_0 */
#define TSI0_CH18_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define ACMP0_IN1_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define ADC0_SE1_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA_1 */
#define FTM1_CH1_PTA1 KINETIS_MUX('A',1,2) /* PTA_1 */
#define LPI2C0_SDAS_PTA1 KINETIS_MUX('A',1,3) /* PTA_1 */
#define FTM1_QD_PHA_PTA1 KINETIS_MUX('A',1,5) /* PTA_1 */
#define LPUART0_RTS_PTA1 KINETIS_MUX('A',1,6) /* PTA_1 */
#define TRGMUX_OUT0_PTA1 KINETIS_MUX('A',1,7) /* PTA_1 */
#define TRGMUX_OUT0_PTA1_PTA1_PTA1_PTA1 KINETIS_MUX('A',1,7) /* PTA_1 */
#define PTA2 KINETIS_MUX('A',2,1) /* PTA_2 */
#define LPI2C0_SDA_PTA2 KINETIS_MUX('A',2,3) /* PTA_2 */
#define EWM_OUT_b_PTA2 KINETIS_MUX('A',2,4) /* PTA_2 */
#define LPUART0_RX_PTA2 KINETIS_MUX('A',2,6) /* PTA_2 */
#define PTA3 KINETIS_MUX('A',3,1) /* PTA_3 */
#define LPI2C0_SCL_PTA3 KINETIS_MUX('A',3,3) /* PTA_3 */
#define EWM_IN_PTA3 KINETIS_MUX('A',3,4) /* PTA_3 */
#define LPUART0_TX_PTA3 KINETIS_MUX('A',3,6) /* PTA_3 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA_4 */
#define ACMP0_OUT_PTA4 KINETIS_MUX('A',4,4) /* PTA_4 */
#define EWM_OUT_b_PTA4 KINETIS_MUX('A',4,5) /* PTA_4 */
#define SWD_DIO_PTA4 KINETIS_MUX('A',4,7) /* PTA_4 */
#define PTA5 KINETIS_MUX('A',5,1) /* PTA_5 */
#define TCLK1_PTA5 KINETIS_MUX('A',5,3) /* PTA_5 */
#define RESET_b_PTA5 KINETIS_MUX('A',5,7) /* PTA_5 */
#define ADC0_SE2_PTA6 KINETIS_MUX('A',6,0) /* PTA_6 */
#define PTA6 KINETIS_MUX('A',6,1) /* PTA_6 */
#define FTM0_FLT1_PTA6 KINETIS_MUX('A',6,2) /* PTA_6 */
#define LPUART1_CTS_PTA6 KINETIS_MUX('A',6,6) /* PTA_6 */
#define ADC0_SE3_PTA7 KINETIS_MUX('A',7,0) /* PTA_7 */
#define PTA7 KINETIS_MUX('A',7,1) /* PTA_7 */
#define FTM0_FLT2_PTA7 KINETIS_MUX('A',7,2) /* PTA_7 */
#define LPSPI0_PCS3_PTA7 KINETIS_MUX('A',7,3) /* PTA_7 */
#define RTC_CLKIN_PTA7 KINETIS_MUX('A',7,4) /* PTA_7 */
#define LPUART1_RTS_PTA7 KINETIS_MUX('A',7,6) /* PTA_7 */
#define ADC0_SE4_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB_0 */
#define LPUART0_RX_PTB0 KINETIS_MUX('B',0,2) /* PTB_0 */
#define LPSPI0_PCS0_PTB0 KINETIS_MUX('B',0,3) /* PTB_0 */
#define LPTMR0_ALT3_PTB0 KINETIS_MUX('B',0,4) /* PTB_0 */
#define PWT_IN3_PTB0 KINETIS_MUX('B',0,5) /* PTB_0 */
#define ADC0_SE5_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB_1 */
#define LPUART0_TX_PTB1 KINETIS_MUX('B',1,2) /* PTB_1 */
#define LPSPI0_SOUT_PTB1 KINETIS_MUX('B',1,3) /* PTB_1 */
#define TCLK0_PTB1 KINETIS_MUX('B',1,4) /* PTB_1 */
#define ADC0_SE6_PTB2 KINETIS_MUX('B',2,0) /* PTB_2 */
#define TSI0_CH20_PTB2 KINETIS_MUX('B',2,0) /* PTB_2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB_2 */
#define FTM1_CH0_PTB2 KINETIS_MUX('B',2,2) /* PTB_2 */
#define LPSPI0_SCK_PTB2 KINETIS_MUX('B',2,3) /* PTB_2 */
#define FTM1_QD_PHB_PTB2 KINETIS_MUX('B',2,4) /* PTB_2 */
#define TRGMUX_IN3_PTB2 KINETIS_MUX('B',2,6) /* PTB_2 */
#define TSI0_CH21_PTB3 KINETIS_MUX('B',3,0) /* PTB_3 */
#define ADC0_SE7_PTB3 KINETIS_MUX('B',3,0) /* PTB_3 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB_3 */
#define FTM1_CH1_PTB3 KINETIS_MUX('B',3,2) /* PTB_3 */
#define LPSPI0_SIN_PTB3 KINETIS_MUX('B',3,3) /* PTB_3 */
#define FTM1_QD_PHA_PTB3 KINETIS_MUX('B',3,4) /* PTB_3 */
#define TRGMUX_IN2_PTB3 KINETIS_MUX('B',3,6) /* PTB_3 */
#define TSI0_CH8_PTB4 KINETIS_MUX('B',4,0) /* PTB_4 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB_4 */
#define FTM0_CH4_PTB4 KINETIS_MUX('B',4,2) /* PTB_4 */
#define LPSPI0_SOUT_PTB4 KINETIS_MUX('B',4,3) /* PTB_4 */
#define TRGMUX_IN1_PTB4 KINETIS_MUX('B',4,6) /* PTB_4 */
#define TSI0_CH9_PTB5 KINETIS_MUX('B',5,0) /* PTB_5 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB_5 */
#define FTM0_CH5_PTB5 KINETIS_MUX('B',5,2) /* PTB_5 */
#define LPSPI0_PCS1_PTB5 KINETIS_MUX('B',5,3) /* PTB_5 */
#define TRGMUX_IN0_PTB5 KINETIS_MUX('B',5,6) /* PTB_5 */
#define XTAL_PTB6 KINETIS_MUX('B',6,0) /* PTB_6 */
#define PTB6 KINETIS_MUX('B',6,1) /* PTB_6 */
#define LPI2C0_SDA_PTB6 KINETIS_MUX('B',6,2) /* PTB_6 */
#define EXTAL_PTB7 KINETIS_MUX('B',7,0) /* PTB_7 */
#define PTB7 KINETIS_MUX('B',7,1) /* PTB_7 */
#define LPI2C0_SCL_PTB7 KINETIS_MUX('B',7,2) /* PTB_7 */
#define TSI0_CH22_PTC0 KINETIS_MUX('C',0,0) /* PTC_0 */
#define ADC0_SE8_PTC0 KINETIS_MUX('C',0,0) /* PTC_0 */
#define PTC0 KINETIS_MUX('C',0,1) /* PTC_0 */
#define FTM0_CH0_PTC0 KINETIS_MUX('C',0,2) /* PTC_0 */
#define ADC0_SE9_PTC1 KINETIS_MUX('C',1,0) /* PTC_1 */
#define TSI0_CH23_PTC1 KINETIS_MUX('C',1,0) /* PTC_1 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC_1 */
#define FTM0_CH1_PTC1 KINETIS_MUX('C',1,2) /* PTC_1 */
#define ACMP0_IN5_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define ADC0_SE10_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC_2 */
#define FTM0_CH2_PTC2 KINETIS_MUX('C',2,2) /* PTC_2 */
#define ADC0_SE11_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define ACMP0_IN4_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC_3 */
#define FTM0_CH3_PTC3 KINETIS_MUX('C',3,2) /* PTC_3 */
#define ACMP0_IN2_PTC4 KINETIS_MUX('C',4,0) /* PTC_4 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC_4 */
#define FTM1_CH0_PTC4 KINETIS_MUX('C',4,2) /* PTC_4 */
#define RTC_CLKOUT_PTC4 KINETIS_MUX('C',4,3) /* PTC_4 */
#define EWM_IN_PTC4 KINETIS_MUX('C',4,5) /* PTC_4 */
#define FTM1_QD_PHB_PTC4 KINETIS_MUX('C',4,6) /* PTC_4 */
#define SWD_CLK_PTC4 KINETIS_MUX('C',4,7) /* PTC_4 */
#define TSI0_CH12_PTC5 KINETIS_MUX('C',5,0) /* PTC_5 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC_5 */
#define RTC_CLKOUT_PTC5 KINETIS_MUX('C',5,3) /* PTC_5 */
#define TSI0_CH15_PTC6 KINETIS_MUX('C',6,0) /* PTC_6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC_6 */
#define LPUART1_RX_PTC6 KINETIS_MUX('C',6,2) /* PTC_6 */
#define CAN0_RX_PTC6 KINETIS_MUX('C',6,5) /* PTC_6 */
#define TSI0_CH16_PTC7 KINETIS_MUX('C',7,0) /* PTC_7 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC_7 */
#define LPUART1_TX_PTC7 KINETIS_MUX('C',7,2) /* PTC_7 */
#define CAN0_TX_PTC7 KINETIS_MUX('C',7,5) /* PTC_7 */
#define TSI0_CH4_PTD0 KINETIS_MUX('D',0,0) /* PTD_0 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD_0 */
#define FTM0_CH2_PTD0 KINETIS_MUX('D',0,2) /* PTD_0 */
#define TRGMUX_OUT1_PTD0 KINETIS_MUX('D',0,7) /* PTD_0 */
#define TRGMUX_OUT1_PTD0_PTD0_PTD0_PTD0 KINETIS_MUX('D',0,7) /* PTD_0 */
#define TSI0_CH5_PTD1 KINETIS_MUX('D',1,0) /* PTD_1 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD_1 */
#define FTM0_CH3_PTD1 KINETIS_MUX('D',1,2) /* PTD_1 */
#define TRGMUX_OUT2_PTD1_PTD1_PTD1_PTD1 KINETIS_MUX('D',1,7) /* PTD_1 */
#define TRGMUX_OUT2_PTD1 KINETIS_MUX('D',1,7) /* PTD_1 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD_2 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD_3 */
#define NMI_b_PTD3 KINETIS_MUX('D',3,7) /* PTD_3 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD_4 */
#define FTM0_FLT3_PTD4 KINETIS_MUX('D',4,2) /* PTD_4 */
#define TSI0_CH6_PTD5 KINETIS_MUX('D',5,0) /* PTD_5 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD_5 */
#define LPTMR0_ALT2_PTD5 KINETIS_MUX('D',5,3) /* PTD_5 */
#define PWT_IN2_PTD5 KINETIS_MUX('D',5,5) /* PTD_5 */
#define LPUART2_CTS_PTD5 KINETIS_MUX('D',5,7) /* PTD_5 */
#define TSI0_CH7_PTD6 KINETIS_MUX('D',6,0) /* PTD_6 */
#define PTD6 KINETIS_MUX('D',6,1) /* PTD_6 */
#define LPUART2_RX_PTD6 KINETIS_MUX('D',6,2) /* PTD_6 */
#define TSI0_CH10_PTD7 KINETIS_MUX('D',7,0) /* PTD_7 */
#define PTD7 KINETIS_MUX('D',7,1) /* PTD_7 */
#define LPUART2_TX_PTD7 KINETIS_MUX('D',7,2) /* PTD_7 */
#define TSI0_CH13_PTE0 KINETIS_MUX('E',0,0) /* PTE_0 */
#define PTE0 KINETIS_MUX('E',0,1) /* PTE_0 */
#define LPSPI0_SCK_PTE0 KINETIS_MUX('E',0,2) /* PTE_0 */
#define TCLK1_PTE0 KINETIS_MUX('E',0,3) /* PTE_0 */
#define TSI0_CH14_PTE1 KINETIS_MUX('E',1,0) /* PTE_1 */
#define PTE1 KINETIS_MUX('E',1,1) /* PTE_1 */
#define LPSPI0_SIN_PTE1 KINETIS_MUX('E',1,2) /* PTE_1 */
#define LPI2C0_HREQ_PTE1 KINETIS_MUX('E',1,3) /* PTE_1 */
#define TSI0_CH19_PTE2 KINETIS_MUX('E',2,0) /* PTE_2 */
#define PTE2 KINETIS_MUX('E',2,1) /* PTE_2 */
#define LPSPI0_SOUT_PTE2 KINETIS_MUX('E',2,2) /* PTE_2 */
#define LPTMR0_ALT3_PTE2 KINETIS_MUX('E',2,3) /* PTE_2 */
#define PWT_IN3_PTE2 KINETIS_MUX('E',2,5) /* PTE_2 */
#define LPUART1_CTS_PTE2 KINETIS_MUX('E',2,6) /* PTE_2 */
#define TSI0_CH24_PTE3 KINETIS_MUX('E',3,0) /* PTE_3 */
#define PTE3 KINETIS_MUX('E',3,1) /* PTE_3 */
#define FTM0_FLT0_PTE3 KINETIS_MUX('E',3,2) /* PTE_3 */
#define LPUART2_RTS_PTE3 KINETIS_MUX('E',3,3) /* PTE_3 */
#define TSI0_CH1_PTE4 KINETIS_MUX('E',4,0) /* PTE_4 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE_4 */
#define BUSOUT_PTE4 KINETIS_MUX('E',4,2) /* PTE_4 */
#define CAN0_RX_PTE4 KINETIS_MUX('E',4,5) /* PTE_4 */
#define EWM_OUT_b_PTE4 KINETIS_MUX('E',4,7) /* PTE_4 */
#define TSI0_CH0_PTE5 KINETIS_MUX('E',5,0) /* PTE_5 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE_5 */
#define TCLK2_PTE5 KINETIS_MUX('E',5,2) /* PTE_5 */
#define CAN0_TX_PTE5 KINETIS_MUX('E',5,5) /* PTE_5 */
#define EWM_IN_PTE5 KINETIS_MUX('E',5,7) /* PTE_5 */
#define PTE6 KINETIS_MUX('E',6,1) /* PTE_6 */
#define LPSPI0_PCS2_PTE6 KINETIS_MUX('E',6,2) /* PTE_6 */
#define LPUART1_RTS_PTE6 KINETIS_MUX('E',6,6) /* PTE_6 */
#define ACMP0_IN3_PTE8 KINETIS_MUX('E',8,0) /* PTE_8 */
#define TSI0_CH11_PTE8 KINETIS_MUX('E',8,0) /* PTE_8 */
#define PTE8 KINETIS_MUX('E',8,1) /* PTE_8 */
#define TSI0_CH2_PTE10 KINETIS_MUX('E',10,0) /* PTE_10 */
#define PTE10 KINETIS_MUX('E',10,1) /* PTE_10 */
#define CLKOUT_PTE10 KINETIS_MUX('E',10,2) /* PTE_10 */
#define TSI0_CH3_PTE11 KINETIS_MUX('E',11,0) /* PTE_11 */
#define PTE11 KINETIS_MUX('E',11,1) /* PTE_11 */
#define PWT_IN1_PTE11 KINETIS_MUX('E',11,2) /* PTE_11 */
#define LPTMR0_ALT1_PTE11 KINETIS_MUX('E',11,3) /* PTE_11 */
#endif
